Ran Plan for 2 projects:

1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
---

### 1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-api-stage"
        name                               = "marketplace-api-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:242" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:241" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-api-stage" -> (known after apply)
      ~ revision                 = 241 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:241" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-web-api-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-web-api-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 2. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-worker-stage"
        name                               = "marketplace-worker-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:191" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:190" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-worker-stage" -> (known after apply)
      ~ revision                 = 190 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:190" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-worker-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-worker-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```